In `shared.tfvars`, the variable `map_additional_iam_roles` is currently `[]`.

Update it to the role arn pertaining to your account as shown in the blog and it should work out.

e.g.

```
map_additional_iam_roles = [
  {
    rolearn = "arn:aws:iam::xxxxxxxxx:role/AWS_xxxxxxxxx_Admins"
    username = "Administrator"
    groups = [
      "system:masters"]
  }
]
```

Sample terraform plan output:

```
# module.eks_cluster.kubernetes_config_map.aws_auth_ignore_changes[0] will be created
  + resource "kubernetes_config_map" "aws_auth_ignore_changes" {
      + data = {
          + "mapAccounts" = jsonencode([])
          + "mapRoles"    = <<~EOT
                - "groups":
                  - "system:masters"
                  "rolearn": "arn:aws:iam::xxxxxxxxx:role/AWS_xxxxxxxxx_Admins"
                  "username": "Administrator"
            EOT
          + "mapUsers"    = jsonencode([])
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }
```